avr-rust/avrd/packs/atmega/ATmega640.atdf
        <module name="CPU">
          <instance name="CPU" caption="CPU Registers">
            <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data" caption="CPU Registers"/>
            <signals>
              <signal group="CLKO" index="0" function="default" pad="PE7"/>
            </signals>
          </instance>
        </module>
        <module name="ADC">
          <instance name="ADC" caption="Analog-to-Digital Converter">
            <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data" caption="Analog-to-Digital Converter"/>
            <signals>
              <signal group="ADC" index="0" function="default" pad="PF0"/>
              <signal group="ADC" index="1" function="default" pad="PF1"/>
              <signal group="ADC" index="2" function="default" pad="PF2"/>
              <signal group="ADC" index="3" function="default" pad="PF3"/>
              <signal group="ADC" index="4" function="default" pad="PF4"/>
              <signal group="ADC" index="5" function="default" pad="PF5"/>
              <signal group="ADC" index="6" function="default" pad="PF6"/>
              <signal group="ADC" index="7" function="default" pad="PF7"/>
              <signal group="ADC" index="8" function="default" pad="PK0"/>
              <signal group="ADC" index="9" function="default" pad="PK1"/>
              <signal group="ADC" index="10" function="default" pad="PK2"/>
              <signal group="ADC" index="11" function="default" pad="PK3"/>
              <signal group="ADC" index="12" function="default" pad="PK4"/>
              <signal group="ADC" index="13" function="default" pad="PK5"/>
              <signal group="ADC" index="14" function="default" pad="PK6"/>
              <signal group="ADC" index="15" function="default" pad="PK7"/>
            </signals>
          </instance>
        </module>
        <module name="BOOT_LOAD">
          <instance name="BOOT_LOAD" caption="Bootloader">
            <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data" caption="Bootloader"/>
          </instance>
        </module>
        <module name="FUSE">
          <instance name="FUSE" caption="Fuses">
            <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
          </instance>
        </module>
        <module name="LOCKBIT">
          <instance name="LOCKBIT" caption="Lockbits">
            <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits" caption="Lockbits"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt index="0" name="RESET" caption="External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     "/>
        <interrupt index="1" name="INT0" caption="External Interrupt Request 0"/>
        <interrupt index="2" name="INT1" caption="External Interrupt Request 1"/>
        <interrupt index="3" name="INT2" caption="External Interrupt Request 2"/>
        <interrupt index="4" name="INT3" caption="External Interrupt Request 3"/>
        <interrupt index="5" name="INT4" caption="External Interrupt Request 4"/>
        <interrupt index="6" name="INT5" caption="External Interrupt Request 5"/>
        <interrupt index="7" name="INT6" caption="External Interrupt Request 6"/>
        <interrupt index="8" name="INT7" caption="External Interrupt Request 7"/>
        <interrupt index="9" name="PCINT0" caption="Pin Change Interrupt Request 0"/>
        <interrupt index="10" name="PCINT1" caption="Pin Change Interrupt Request 1"/>
        <interrupt index="11" name="PCINT2" caption="Pin Change Interrupt Request 2"/>
        <interrupt index="12" name="WDT" caption="Watchdog Time-out Interrupt"/>
        <interrupt index="13" name="TIMER2_COMPA" caption="Timer/Counter2 Compare Match A"/>
        <interrupt index="14" name="TIMER2_COMPB" caption="Timer/Counter2 Compare Match B"/>
        <interrupt index="15" name="TIMER2_OVF" caption="Timer/Counter2 Overflow"/>
        <interrupt index="16" name="TIMER1_CAPT" caption="Timer/Counter1 Capture Event"/>
        <interrupt index="17" name="TIMER1_COMPA" caption="Timer/Counter1 Compare Match A"/>
        <interrupt index="18" name="TIMER1_COMPB" caption="Timer/Counter1 Compare Match B"/>
        <interrupt index="19" name="TIMER1_COMPC" caption="Timer/Counter1 Compare Match C"/>
        <interrupt index="20" name="TIMER1_OVF" caption="Timer/Counter1 Overflow"/>
        <interrupt index="21" name="TIMER0_COMPA" caption="Timer/Counter0 Compare Match A"/>
        <interrupt index="22" name="TIMER0_COMPB" caption="Timer/Counter0 Compare Match B"/>
        <interrupt index="23" name="TIMER0_OVF" caption="Timer/Counter0 Overflow"/>
        <interrupt index="24" name="SPI_STC" caption="SPI Serial Transfer Complete"/>
        <interrupt index="25" name="USART0_RX" caption="USART0, Rx Complete"/>
        <interrupt index="26" name="USART0_UDRE" caption="USART0 Data register Empty"/>
        <interrupt index="27" name="USART0_TX" caption="USART0, Tx Complete"/>
        <interrupt index="28" name="ANALOG_COMP" caption="Analog Comparator"/>
        <interrupt index="29" name="ADC" caption="ADC Conversion Complete"/>
        <interrupt index="30" name="EE_READY" caption="EEPROM Ready"/>
        <interrupt index="31" name="TIMER3_CAPT" caption="Timer/Counter3 Capture Event"/>
        <interrupt index="32" name="TIMER3_COMPA" caption="Timer/Counter3 Compare Match A"/>
        <interrupt index="33" name="TIMER3_COMPB" caption="Timer/Counter3 Compare Match B"/>
        <interrupt index="34" name="TIMER3_COMPC" caption="Timer/Counter3 Compare Match C"/>
        <interrupt index="35" name="TIMER3_OVF" caption="Timer/Counter3 Overflow"/>
        <interrupt index="36" name="USART1_RX" caption="USART1, Rx Complete"/>
        <interrupt index="37" name="USART1_UDRE" caption="USART1 Data register Empty"/>
        <interrupt index="38" name="USART1_TX" caption="USART1, Tx Complete"/>
        <interrupt index="39" name="TWI" caption="2-wire Serial Interface"/>
        <interrupt index="40" name="SPM_READY" caption="Store Program Memory Read"/>
        <interrupt index="41" name="TIMER4_CAPT" caption="Timer/Counter4 Capture Event"/>
        <interrupt index="42" name="TIMER4_COMPA" caption="Timer/Counter4 Compare Match A"/>
        <interrupt index="43" name="TIMER4_COMPB" caption="Timer/Counter4 Compare Match B"/>
        <interrupt index="44" name="TIMER4_COMPC" caption="Timer/Counter4 Compare Match C"/>
        <interrupt index="45" name="TIMER4_OVF" caption="Timer/Counter4 Overflow"/>
        <interrupt index="46" name="TIMER5_CAPT" caption="Timer/Counter5 Capture Event"/>
        <interrupt index="47" name="TIMER5_COMPA" caption="Timer/Counter5 Compare Match A"/>
        <interrupt index="48" name="TIMER5_COMPB" caption="Timer/Counter5 Compare Match B"/>
        <interrupt index="49" name="TIMER5_COMPC" caption="Timer/Counter5 Compare Match C"/>
        <interrupt index="50" name="TIMER5_OVF" caption="Timer/Counter5 Overflow"/>
        <interrupt index="51" name="USART2_RX" caption="USART2, Rx Complete"/>
        <interrupt index="52" name="USART2_UDRE" caption="USART2 Data register Empty"/>
        <interrupt index="53" name="USART2_TX" caption="USART2, Tx Complete"/>
        <interrupt index="54" name="USART3_RX" caption="USART3, Rx Complete"/>
        <interrupt index="55" name="USART3_UDRE" caption="USART3 Data register Empty"/>
        <interrupt index="56" name="USART3_TX" caption="USART3, Tx Complete"/>
      </interrupts>
      <interfaces>
        <interface name="ISP" type="isp"/>
        <interface name="HVPP" type="hvpp"/>
        <interface name="JTAG" type="megajtag"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x0960803F"/>
          <property name="SIGNATURE0" value="0x1e"/>
          <property name="SIGNATURE1" value="0x96"/>
          <property name="SIGNATURE2" value="0x08"/>
        </property-group>
        <property-group name="OCD">
          <property name="OCD_REVISION" value="3"/>
          <property name="OCD_DATAREG" value="0x31"/>
          <property name="PROGBASE" value="0x0000"/>
        </property-group>
        <property-group name="JTAG_INTERFACE">
          <property name="ALLOWFULLPAGESTREAM" value="0x00"/>
        </property-group>
        <property-group name="ISP_INTERFACE">
          <property name="IspEnterProgMode_timeout" value="200"/>
          <property name="IspEnterProgMode_stabDelay" value="100"/>
          <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
          <property name="IspEnterProgMode_synchLoops" value="32"/>
          <property name="IspEnterProgMode_byteDelay" value="0"/>
          <property name="IspEnterProgMode_pollIndex" value="3"/>
          <property name="IspEnterProgMode_pollValue" value="0x53"/>
          <property name="IspLeaveProgMode_preDelay" value="1"/>
          <property name="IspLeaveProgMode_postDelay" value="1"/>
          <property name="IspChipErase_eraseDelay" value="55"/>
          <property name="IspChipErase_pollMethod" value="1"/>
          <property name="IspProgramFlash_mode" value="0x41"/>
          <property name="IspProgramFlash_blockSize" value="256"/>
          <property name="IspProgramFlash_delay" value="10"/>
          <property name="IspProgramFlash_cmd1" value="0x40"/>
          <property name="IspProgramFlash_cmd2" value="0x4C"/>
          <property name="IspProgramFlash_cmd3" value="0x00"/>
          <property name="IspProgramFlash_pollVal1" value="0x00"/>
          <property name="IspProgramFlash_pollVal2" value="0x00"/>
          <property name="IspProgramEeprom_mode" value="0x41"/>
          <property name="IspProgramEeprom_blockSize" value="8"/>
          <property name="IspProgramEeprom_delay" value="10"/>
          <property name="IspProgramEeprom_cmd1" value="0xC1"/>
          <property name="IspProgramEeprom_cmd2" value="0xC2"/>
          <property name="IspProgramEeprom_cmd3" value="0x00"/>
          <property name="IspProgramEeprom_pollVal1" value="0x00"/>
          <property name="IspProgramEeprom_pollVal2" value="0x00"/>
          <property name="IspReadFlash_blockSize" value="256"/>
          <property name="IspReadEeprom_blockSize" value="256"/>
          <property name="IspReadFuse_pollIndex" value="4"/>
          <property name="IspReadLock_pollIndex" value="4"/>
          <property name="IspReadSign_pollIndex" value="4"/>
          <property name="IspReadOsccal_pollIndex" value="4"/>
        </property-group>
        <property-group name="PP_INTERFACE">
          <property name="PpControlStack" value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
          <property name="PpEnterProgMode_stabDelay" value="100"/>
          <property name="PpEnterProgMode_progModeDelay" value="0"/>
          <property name="PpEnterProgMode_latchCycles" value="5"/>
          <property name="PpEnterProgMode_toggleVtg" value="1"/>
          <property name="PpEnterProgMode_powerOffDelay" value="15"/>
          <property name="PpEnterProgMode_resetDelayMs" value="1"/>
          <property name="PpEnterProgMode_resetDelayUs" value="0"/>
          <property name="PpLeaveProgMode_stabDelay" value="15"/>
          <property name="PpLeaveProgMode_resetDelay" value="15"/>
          <property name="PpChipErase_pulseWidth" value="0"/>
          <property name="PpChipErase_pollTimeout" value="10"/>
          <property name="PpProgramFlash_pollTimeout" value="5"/>
          <property name="PpProgramFlash_mode" value="0x01"/>
          <property name="PpProgramFlash_blockSize" value="256"/>
          <property name="PpReadFlash_blockSize" value="256"/>
          <property name="PpProgramEeprom_pollTimeout" value="5"/>
          <property name="PpProgramEeprom_mode" value="0x07"/>
          <property name="PpProgramEeprom_blockSize" value="256"/>
          <property name="PpReadEeprom_blockSize" value="256"/>
          <property name="PpProgramFuse_pulseWidth" value="0"/>
          <property name="PpProgramFuse_pollTimeout" value="5"/>
          <property name="PpProgramLock_pulseWidth" value="0"/>
          <property name="PpProgramLock_pollTimeout" value="5"/>
        </property-group>
        <property-group name="ISP_INTERFACE_STK600">
          <property name="IspEnterProgMode_timeout" value="200"/>
          <property name="IspEnterProgMode_stabDelay" value="100"/>
          <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
          <property name="IspEnterProgMode_synchLoops" value="32"/>
          <property name="IspEnterProgMode_byteDelay" value="0"/>
          <property name="IspEnterProgMode_pollIndex" value="3"/>
          <property name="IspEnterProgMode_pollValue" value="0x53"/>
          <property name="IspLeaveProgMode_preDelay" value="1"/>
          <property name="IspLeaveProgMode_postDelay" value="1"/>
          <property name="IspChipErase_eraseDelay" value="55"/>
          <property name="IspChipErase_pollMethod" value="1"/>
          <property name="IspProgramFlash_mode" value="0x41"/>
          <property name="IspProgramFlash_blockSize" value="256"/>
          <property name="IspProgramFlash_delay" value="6"/>
          <property name="IspProgramFlash_cmd1" value="0x40"/>
          <property name="IspProgramFlash_cmd2" value="0x4C"/>
          <property name="IspProgramFlash_cmd3" value="0x00"/>
          <property name="IspProgramFlash_pollVal1" value="0x00"/>
          <property name="IspProgramFlash_pollVal2" value="0x00"/>
          <property name="IspProgramEeprom_mode" value="0x41"/>
          <property name="IspProgramEeprom_blockSize" value="8"/>
          <property name="IspProgramEeprom_delay" value="10"/>
          <property name="IspProgramEeprom_cmd1" value="0xC1"/>
          <property name="IspProgramEeprom_cmd2" value="0xC2"/>
          <property name="IspProgramEeprom_cmd3" value="0x00"/>
          <property name="IspProgramEeprom_pollVal1" value="0x00"/>
          <property name="IspProgramEeprom_pollVal2" value="0x00"/>
          <property name="IspReadFlash_blockSize" value="256"/>
          <property name="IspReadEeprom_blockSize" value="256"/>
          <property name="IspReadFuse_pollIndex" value="4"/>
          <property name="IspReadLock_pollIndex" value="4"/>
          <property name="IspReadSign_pollIndex" value="4"/>
          <property name="IspReadOsccal_pollIndex" value="4"/>
        </property-group>
        <property-group name="PP_INTERFACE_STK600">
          <property name="PpControlStack" value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
          <property name="PpEnterProgMode_stabDelay" value="100"/>
          <property name="PpEnterProgMode_progModeDelay" value="0"/>
          <property name="PpEnterProgMode_latchCycles" value="6"/>
          <property name="PpEnterProgMode_toggleVtg" value="0"/>
          <property name="PpEnterProgMode_powerOffDelay" value="0"/>
          <property name="PpEnterProgMode_resetDelayMs" value="0"/>
          <property name="PpEnterProgMode_resetDelayUs" value="0"/>
          <property name="PpLeaveProgMode_stabDelay" value="15"/>
          <property name="PpLeaveProgMode_resetDelay" value="15"/>
          <property name="PpChipErase_pulseWidth" value="0"/>
          <property name="PpChipErase_pollTimeout" value="10"/>
          <property name="PpProgramFlash_pollTimeout" value="5"/>
          <property name="PpProgramFlash_mode" value="0x01"/>
          <property name="PpProgramFlash_blockSize" value="256"/>
          <property name="PpReadFlash_blockSize" value="256"/>
          <property name="PpProgramEeprom_pollTimeout" value="5"/>
          <property name="PpProgramEeprom_mode" value="0x07"/>
          <property name="PpProgramEeprom_blockSize" value="256"/>
          <property name="PpReadEeprom_blockSize" value="256"/>
          <property name="PpProgramFuse_pulseWidth" value="0"/>
          <property name="PpProgramFuse_pollTimeout" value="5"/>
          <property name="PpProgramLock_pulseWidth" value="0"/>
          <property name="PpProgramLock_pollTimeout" value="5"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Fuses" name="FUSE">
      <register-group caption="Fuses" name="FUSE">
        <register caption="" name="EXTENDED" offset="0x02" size="1" initval="0xFF">
          <bitfield caption="Brown-out Detector trigger level" mask="0x07" name="BODLEVEL" values="ENUM_BODLEVEL"/>
        </register>
        <register caption="" name="HIGH" offset="0x01" size="1" initval="0x99">
          <bitfield caption="On-Chip Debug Enabled" mask="0x80" name="OCDEN"/>
          <bitfield caption="JTAG Interface Enabled" mask="0x40" name="JTAGEN"/>
          <bitfield caption="Serial program downloading (SPI) enabled" mask="0x20" name="SPIEN"/>
          <bitfield caption="Watchdog timer always on" mask="0x10" name="WDTON"/>
          <bitfield caption="Preserve EEPROM through the Chip Erase cycle" mask="0x08" name="EESAVE"/>
          <bitfield caption="Select Boot Size" mask="0x06" name="BOOTSZ" values="ENUM_BOOTSZ"/>
          <bitfield caption="Boot Reset vector Enabled (default address=$0000)" mask="0x01" name="BOOTRST"/>
        </register>
