avr-rust/avrd/packs/atmega/ATmega640.atdf
    <module caption="Serial Peripheral Interface" name="SPI">
      <register-group caption="Serial Peripheral Interface" name="SPI">
        <register caption="SPI Control Register" name="SPCR" offset="0x4C" size="1">
          <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
          <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
          <bitfield caption="Data Order" mask="0x20" name="DORD"/>
          <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
          <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
          <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
        </register>
        <register caption="SPI Status Register" name="SPSR" offset="0x4D" size="1" ocd-rw="R">
          <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
          <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
          <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
        </register>
        <register caption="SPI Data Register" name="SPDR" offset="0x4E" size="1" mask="0xFF" ocd-rw=""/>
      </register-group>
      <value-group caption="" name="COMM_SCK_RATE_3BIT">
        <value caption="fosc/4" name="VAL_0x00" value="0x00"/>
        <value caption="fosc/16" name="VAL_0x01" value="0x01"/>
        <value caption="fosc/64" name="VAL_0x02" value="0x02"/>
        <value caption="fosc/128" name="VAL_0x03" value="0x03"/>
        <value caption="fosc/2" name="VAL_0x04" value="0x04"/>
        <value caption="fosc/8" name="VAL_0x05" value="0x05"/>
        <value caption="fosc/32" name="VAL_0x06" value="0x06"/>
        <value caption="fosc/64" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTA">
        <register caption="Port A Data Register" name="PORTA" offset="0x22" size="1" mask="0xFF"/>
        <register caption="Port A Data Direction Register" name="DDRA" offset="0x21" size="1" mask="0xFF"/>
        <register caption="Port A Input Pins" name="PINA" offset="0x20" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port B Data Register" name="PORTB" offset="0x25" size="1" mask="0xFF"/>
        <register caption="Port B Data Direction Register" name="DDRB" offset="0x24" size="1" mask="0xFF"/>
        <register caption="Port B Input Pins" name="PINB" offset="0x23" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTC">
        <register caption="Port C Data Register" name="PORTC" offset="0x28" size="1" mask="0xFF"/>
        <register caption="Port C Data Direction Register" name="DDRC" offset="0x27" size="1" mask="0xFF"/>
        <register caption="Port C Input Pins" name="PINC" offset="0x26" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTD">
        <register caption="Port D Data Register" name="PORTD" offset="0x2B" size="1" mask="0xFF"/>
        <register caption="Port D Data Direction Register" name="DDRD" offset="0x2A" size="1" mask="0xFF"/>
        <register caption="Port D Input Pins" name="PIND" offset="0x29" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTE">
        <register caption="Data Register, Port E" name="PORTE" offset="0x2E" size="1" mask="0xFF"/>
        <register caption="Data Direction Register, Port E" name="DDRE" offset="0x2D" size="1" mask="0xFF"/>
        <register caption="Input Pins, Port E" name="PINE" offset="0x2C" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTF">
        <register caption="Data Register, Port F" name="PORTF" offset="0x31" size="1" mask="0xFF"/>
        <register caption="Data Direction Register, Port F" name="DDRF" offset="0x30" size="1" mask="0xFF"/>
        <register caption="Input Pins, Port F" name="PINF" offset="0x2F" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTG">
        <register caption="Data Register, Port G" name="PORTG" offset="0x34" size="1" mask="0x3F"/>
        <register caption="Data Direction Register, Port G" name="DDRG" offset="0x33" size="1" mask="0x3F"/>
        <register caption="Input Pins, Port G" name="PING" offset="0x32" size="1" mask="0x3F"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTH">
        <register caption="PORT H Data Register" name="PORTH" offset="0x102" size="1" mask="0xFF"/>
        <register caption="PORT H Data Direction Register" name="DDRH" offset="0x101" size="1" mask="0xFF"/>
        <register caption="PORT H Input Pins" name="PINH" offset="0x100" size="1" mask="0xFF"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTJ">
        <register caption="PORT J Data Register" name="PORTJ" offset="0x105" size="1" mask="0xFF"/>
        <register caption="PORT J Data Direction Register" name="DDRJ" offset="0x104" size="1" mask="0xFF"/>
        <register caption="PORT J Input Pins" name="PINJ" offset="0x103" size="1" mask="0xFF"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTK">
        <register caption="PORT K Data Register" name="PORTK" offset="0x108" size="1" mask="0xFF"/>
        <register caption="PORT K Data Direction Register" name="DDRK" offset="0x107" size="1" mask="0xFF"/>
        <register caption="PORT K Input Pins" name="PINK" offset="0x106" size="1" mask="0xFF"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTL">
        <register caption="PORT L Data Register" name="PORTL" offset="0x10B" size="1" mask="0xFF"/>
        <register caption="PORT L Data Direction Register" name="DDRL" offset="0x10A" size="1" mask="0xFF"/>
        <register caption="PORT L Input Pins" name="PINL" offset="0x109" size="1" mask="0xFF"/>
      </register-group>
    </module>
    <module caption="Timer/Counter, 8-bit" name="TC8">
      <register-group caption="Timer/Counter, 8-bit" name="TC0">
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x48" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x47" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0" name="TCNT0" offset="0x46" size="1" mask="0xFF"/>
