avr-rust/avrd/packs/atmega/ATmega640.atdf
        <register caption="Timer/Counter4  Bytes" name="TCNT4" offset="0xA4" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter4 Output Compare Register A  Bytes" name="OCR4A" offset="0xA8" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter4 Output Compare Register B  Bytes" name="OCR4B" offset="0xAA" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter4 Output Compare Register B  Bytes" name="OCR4C" offset="0xAC" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter4 Input Capture Register  Bytes" name="ICR4" offset="0xA6" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter4 Interrupt Mask Register" name="TIMSK4" offset="0x72" size="1">
          <bitfield caption="Timer/Counter4 Input Capture Interrupt Enable" mask="0x20" name="ICIE4"/>
          <bitfield caption="Timer/Counter4 Output Compare C Match Interrupt Enable" mask="0x08" name="OCIE4C"/>
          <bitfield caption="Timer/Counter4 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE4B"/>
          <bitfield caption="Timer/Counter4 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE4A"/>
          <bitfield caption="Timer/Counter4 Overflow Interrupt Enable" mask="0x01" name="TOIE4"/>
        </register>
        <register caption="Timer/Counter4 Interrupt Flag register" name="TIFR4" offset="0x39" size="1" ocd-rw="">
          <bitfield caption="Input Capture Flag 4" mask="0x20" name="ICF4"/>
          <bitfield caption="Output Compare Flag 4C" mask="0x08" name="OCF4C"/>
          <bitfield caption="Output Compare Flag 4B" mask="0x04" name="OCF4B"/>
          <bitfield caption="Output Compare Flag 4A" mask="0x02" name="OCF4A"/>
          <bitfield caption="Timer/Counter4 Overflow Flag" mask="0x01" name="TOV4"/>
        </register>
      </register-group>
      <register-group caption="Timer/Counter, 16-bit" name="TC3">
        <register caption="Timer/Counter3 Control Register A" name="TCCR3A" offset="0x90" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM3A"/>
          <bitfield caption="Compare Output Mode 3B, bits" mask="0x30" name="COM3B"/>
          <bitfield caption="Compare Output Mode 3C, bits" mask="0x0C" name="COM3C"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM3"/>
        </register>
        <register caption="Timer/Counter3 Control Register B" name="TCCR3B" offset="0x91" size="1">
          <bitfield caption="Input Capture 3 Noise Canceler" mask="0x80" name="ICNC3"/>
          <bitfield caption="Input Capture 3 Edge Select" mask="0x40" name="ICES3"/>
          <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM3" lsb="2"/>
          <bitfield caption="Prescaler source of Timer/Counter 3" mask="0x07" name="CS3" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter 3 Control Register C" name="TCCR3C" offset="0x92" size="1">
          <bitfield caption="Force Output Compare 3A" mask="0x80" name="FOC3A"/>
          <bitfield caption="Force Output Compare 3B" mask="0x40" name="FOC3B"/>
          <bitfield caption="Force Output Compare 3C" mask="0x20" name="FOC3C"/>
        </register>
        <register caption="Timer/Counter3  Bytes" name="TCNT3" offset="0x94" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Output Compare Register A  Bytes" name="OCR3A" offset="0x98" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Output Compare Register B  Bytes" name="OCR3B" offset="0x9A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Output Compare Register B  Bytes" name="OCR3C" offset="0x9C" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Input Capture Register  Bytes" name="ICR3" offset="0x96" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Interrupt Mask Register" name="TIMSK3" offset="0x71" size="1">
          <bitfield caption="Timer/Counter3 Input Capture Interrupt Enable" mask="0x20" name="ICIE3"/>
          <bitfield caption="Timer/Counter3 Output Compare C Match Interrupt Enable" mask="0x08" name="OCIE3C"/>
          <bitfield caption="Timer/Counter3 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE3B"/>
          <bitfield caption="Timer/Counter3 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE3A"/>
          <bitfield caption="Timer/Counter3 Overflow Interrupt Enable" mask="0x01" name="TOIE3"/>
        </register>
        <register caption="Timer/Counter3 Interrupt Flag register" name="TIFR3" offset="0x38" size="1" ocd-rw="R">
          <bitfield caption="Input Capture Flag 3" mask="0x20" name="ICF3"/>
          <bitfield caption="Output Compare Flag 3C" mask="0x08" name="OCF3C"/>
          <bitfield caption="Output Compare Flag 3B" mask="0x04" name="OCF3B"/>
          <bitfield caption="Output Compare Flag 3A" mask="0x02" name="OCF3A"/>
          <bitfield caption="Timer/Counter3 Overflow Flag" mask="0x01" name="TOV3"/>
        </register>
      </register-group>
      <register-group caption="Timer/Counter, 16-bit" name="TC1">
        <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x80" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
          <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
          <bitfield caption="Compare Output Mode 1C, bits" mask="0x0C" name="COM1C"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM1"/>
        </register>
        <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x81" size="1">
          <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
          <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
          <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
          <bitfield caption="Prescaler source of Timer/Counter 1" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter 1 Control Register C" name="TCCR1C" offset="0x82" size="1">
          <bitfield caption="Force Output Compare 1A" mask="0x80" name="FOC1A"/>
          <bitfield caption="Force Output Compare 1B" mask="0x40" name="FOC1B"/>
          <bitfield caption="Force Output Compare 1C" mask="0x20" name="FOC1C"/>
        </register>
