avr-rust/avrd/packs/atmega/ATmega640.atdf
      <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
        <value caption="256" name="VAL_0x08" value="0x08"/>
      </value-group>
      <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Reserved" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Standby" name="STDBY" value="0x06"/>
        <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      <parameters>
        <param name="CORE_VERSION" value="V3"/>
      </parameters>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
          <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF6"/>
          <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"/>
        </register>
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
        <register caption="The ADC Control and Status register A" name="ADCSRA" offset="0x7A" size="1" ocd-rw="R">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC  Auto Trigger Enable" mask="0x20" name="ADATE"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC  Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="The ADC Control and Status register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield caption="" mask="0x40" name="ACME"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x08" name="MUX5"/>
          <bitfield caption="ADC Auto Trigger Source bits" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER"/>
        </register>
        <register caption="Digital Input Disable Register" name="DIDR2" offset="0x7D" size="1">
          <bitfield caption="" mask="0x80" name="ADC15D"/>
          <bitfield caption="" mask="0x40" name="ADC14D"/>
          <bitfield caption="" mask="0x20" name="ADC13D"/>
          <bitfield caption="" mask="0x10" name="ADC12D"/>
          <bitfield caption="" mask="0x08" name="ADC11D"/>
          <bitfield caption="" mask="0x04" name="ADC10D"/>
          <bitfield caption="" mask="0x02" name="ADC9D"/>
          <bitfield caption="" mask="0x01" name="ADC8D"/>
        </register>
        <register caption="Digital Input Disable Register" name="DIDR0" offset="0x7E" size="1">
          <bitfield caption="" mask="0x80" name="ADC7D"/>
          <bitfield caption="" mask="0x40" name="ADC6D"/>
          <bitfield caption="" mask="0x20" name="ADC5D"/>
          <bitfield caption="" mask="0x10" name="ADC4D"/>
          <bitfield caption="" mask="0x08" name="ADC3D"/>
          <bitfield caption="" mask="0x04" name="ADC2D"/>
          <bitfield caption="" mask="0x02" name="ADC1D"/>
          <bitfield caption="" mask="0x01" name="ADC0D"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_ADC_V_REF6">
        <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
        <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
        <value caption="Internal 1.1V Voltage Reference with external capacitor at AREF pin" name="VAL_0x02" value="0x02"/>
        <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER">
        <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
        <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
        <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
          <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="TQFP">
      <pin pad="PG5" position="1"/>
      <pin pad="PE0" position="2"/>
      <pin pad="PE1" position="3"/>
      <pin pad="PE2" position="4"/>
      <pin pad="PE3" position="5"/>
      <pin pad="PE4" position="6"/>
      <pin pad="PE5" position="7"/>
      <pin pad="PE6" position="8"/>
      <pin pad="PE7" position="9"/>
      <pin pad="VCC" position="10"/>
      <pin pad="GND" position="11"/>
      <pin pad="PH0" position="12"/>
      <pin pad="PH1" position="13"/>
      <pin pad="PH2" position="14"/>
      <pin pad="PH3" position="15"/>
      <pin pad="PH4" position="16"/>
      <pin pad="PH5" position="17"/>
      <pin pad="PH6" position="18"/>
      <pin pad="PB0" position="19"/>
      <pin pad="PB1" position="20"/>
      <pin pad="PB2" position="21"/>
      <pin pad="PB3" position="22"/>
      <pin pad="PB4" position="23"/>
      <pin pad="PB5" position="24"/>
      <pin pad="PB6" position="25"/>
      <pin pad="PB7" position="26"/>
      <pin pad="PH7" position="27"/>
      <pin pad="PG3" position="28"/>
      <pin pad="PG4" position="29"/>
      <pin pad="RESET" position="30"/>
      <pin pad="VCC" position="31"/>
      <pin pad="GND" position="32"/>
      <pin pad="XTAL2" position="33"/>
      <pin pad="XTAL1" position="34"/>
      <pin pad="PL0" position="35"/>
      <pin pad="PL1" position="36"/>
      <pin pad="PL2" position="37"/>
      <pin pad="PL3" position="38"/>
      <pin pad="PL4" position="39"/>
      <pin pad="PL5" position="40"/>
      <pin pad="PL6" position="41"/>
      <pin pad="PL7" position="42"/>
      <pin pad="PD0" position="43"/>
      <pin pad="PD1" position="44"/>
      <pin pad="PD2" position="45"/>
      <pin pad="PD3" position="46"/>
      <pin pad="PD4" position="47"/>
      <pin pad="PD5" position="48"/>
      <pin pad="PD6" position="49"/>
      <pin pad="PD7" position="50"/>
      <pin pad="PG0" position="51"/>
      <pin pad="PG1" position="52"/>
      <pin pad="PC0" position="53"/>
      <pin pad="PC1" position="54"/>
      <pin pad="PC2" position="55"/>
      <pin pad="PC3" position="56"/>
      <pin pad="PC4" position="57"/>
      <pin pad="PC5" position="58"/>
      <pin pad="PC6" position="59"/>
      <pin pad="PC7" position="60"/>
      <pin pad="VCC" position="61"/>
      <pin pad="GND" position="62"/>
      <pin pad="PJ0" position="63"/>
      <pin pad="PJ1" position="64"/>
      <pin pad="PJ2" position="65"/>
      <pin pad="PJ3" position="66"/>
      <pin pad="PJ4" position="67"/>
      <pin pad="PJ5" position="68"/>
      <pin pad="PJ6" position="69"/>
      <pin pad="PG2" position="70"/>
      <pin pad="PA7" position="71"/>
      <pin pad="PA6" position="72"/>
      <pin pad="PA5" position="73"/>
      <pin pad="PA4" position="74"/>
      <pin pad="PA3" position="75"/>
      <pin pad="PA2" position="76"/>
      <pin pad="PA1" position="77"/>
      <pin pad="PA0" position="78"/>
      <pin pad="PJ7" position="79"/>
      <pin pad="VCC" position="80"/>
      <pin pad="GND" position="81"/>
      <pin pad="PK7" position="82"/>
      <pin pad="PK6" position="83"/>
      <pin pad="PK5" position="84"/>
      <pin pad="PK4" position="85"/>
      <pin pad="PK3" position="86"/>
      <pin pad="PK2" position="87"/>
      <pin pad="PK1" position="88"/>
      <pin pad="PK0" position="89"/>
      <pin pad="PF7" position="90"/>
      <pin pad="PF6" position="91"/>
      <pin pad="PF5" position="92"/>
      <pin pad="PF4" position="93"/>
      <pin pad="PF3" position="94"/>
      <pin pad="PF2" position="95"/>
      <pin pad="PF1" position="96"/>
      <pin pad="PF0" position="97"/>
      <pin pad="AREF" position="98"/>
      <pin pad="GND" position="99"/>
      <pin pad="AVCC" position="100"/>
    </pinout>
    <pinout name="CBGA">
      <pin pad="GND" position="A1"/>
      <pin pad="AVCC" position="B1"/>
      <pin pad="PE2" position="C1"/>
      <pin pad="PE3" position="D1"/>
      <pin pad="PE7" position="E1"/>
      <pin pad="VCC" position="F1"/>
      <pin pad="GND" position="G1"/>
      <pin pad="PB3" position="H1"/>
      <pin pad="PH7" position="J1"/>
      <pin pad="PB7" position="K1"/>
      <pin pad="AREF" position="A2"/>
      <pin pad="PG5" position="B2"/>
      <pin pad="PE0" position="C2"/>
      <pin pad="PE4" position="D2"/>
      <pin pad="PH0" position="E2"/>
      <pin pad="PH4" position="F2"/>
      <pin pad="PB1" position="G2"/>
      <pin pad="PB4" position="H2"/>
      <pin pad="PG3" position="J2"/>
      <pin pad="PG4" position="K2"/>
      <pin pad="PF0" position="A3"/>
      <pin pad="PF1" position="B3"/>
      <pin pad="PE1" position="C3"/>
      <pin pad="PE5" position="D3"/>
      <pin pad="PH1" position="E3"/>
      <pin pad="PH6" position="F3"/>
      <pin pad="PB2" position="G3"/>
      <pin pad="RESET" position="H3"/>
      <pin pad="PB6" position="J3"/>
      <pin pad="VCC" position="K3"/>
      <pin pad="PF2" position="A4"/>
      <pin pad="PF3" position="B4"/>
      <pin pad="PF4" position="C4"/>
      <pin pad="PE6" position="D4"/>
      <pin pad="PH3" position="E4"/>
      <pin pad="PB0" position="F4"/>
      <pin pad="PB5" position="G4"/>
      <pin pad="PL1" position="H4"/>
      <pin pad="PL0" position="J4"/>
      <pin pad="GND" position="K4"/>
      <pin pad="PF5" position="A5"/>
      <pin pad="PF6" position="B5"/>
      <pin pad="PF7" position="C5"/>
      <pin pad="PH2" position="D5"/>
      <pin pad="PH5" position="E5"/>
      <pin pad="PL4" position="F5"/>
      <pin pad="PL2" position="G5"/>
      <pin pad="PL3" position="H5"/>
      <pin pad="XTAL2" position="J5"/>
      <pin pad="XTAL1" position="K5"/>
      <pin pad="PK0" position="A6"/>
      <pin pad="PK1" position="B6"/>
      <pin pad="PK2" position="C6"/>
      <pin pad="PA4" position="D6"/>
      <pin pad="PJ6" position="E6"/>
      <pin pad="PD1" position="F6"/>
      <pin pad="PD0" position="G6"/>
      <pin pad="PL7" position="H6"/>
      <pin pad="PL6" position="J6"/>
      <pin pad="PL5" position="K6"/>
      <pin pad="PK3" position="A7"/>
      <pin pad="PK4" position="B7"/>
      <pin pad="PK5" position="C7"/>
      <pin pad="PA5" position="D7"/>
      <pin pad="PJ5" position="E7"/>
      <pin pad="PJ1" position="F7"/>
      <pin pad="PD5" position="G7"/>
      <pin pad="PD4" position="H7"/>
      <pin pad="PD3" position="J7"/>
      <pin pad="PD2" position="K7"/>
      <pin pad="PK6" position="A8"/>
      <pin pad="PK7" position="B8"/>
      <pin pad="PJ7" position="C8"/>
      <pin pad="PA6" position="D8"/>
      <pin pad="PJ4" position="E8"/>
      <pin pad="PJ0" position="F8"/>
      <pin pad="PC5" position="G8"/>
      <pin pad="PC4" position="H8"/>
      <pin pad="PC1" position="J8"/>
      <pin pad="PD6" position="K8"/>
      <pin pad="GND" position="A9"/>
      <pin pad="PA0" position="B9"/>
      <pin pad="PA1" position="C9"/>
      <pin pad="PA7" position="D9"/>
      <pin pad="PJ3" position="E9"/>
      <pin pad="PC7" position="F9"/>
      <pin pad="PC6" position="G9"/>
      <pin pad="PC3" position="H9"/>
      <pin pad="PC0" position="J9"/>
      <pin pad="PD7" position="K9"/>
      <pin pad="VCC" position="A10"/>
      <pin pad="PA2" position="B10"/>
      <pin pad="PA3" position="C10"/>
      <pin pad="PG2" position="D10"/>
      <pin pad="PJ2" position="E10"/>
      <pin pad="GND" position="F10"/>
      <pin pad="VCC" position="G10"/>
      <pin pad="PC2" position="H10"/>
      <pin pad="PG1" position="J10"/>
      <pin pad="PG0" position="K10"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
